RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_network_mw_core.c
/*
 * $ Copyright Cypress Semiconductor $
*/

#include <string.h>
#include <stdint.h>
#include "lwipopts.h"
#include "lwip/netif.h"
#include "lwip/netifapi.h"
#include "lwip/init.h"
#include "lwip/dhcp.h"
#include "lwip/etharp.h"
#include "lwip/tcpip.h"
#include "lwip/ethip6.h"
#include "lwip/igmp.h"
#include "lwip/nd6.h"
#include "netif/ethernet.h"
#include "lwip/prot/autoip.h"
#include "lwip/prot/dhcp.h"
#include "lwip/dns.h"
#include "lwip/inet_chksum.h"
#include "lwip/icmp.h"
#include "lwip/inet.h"
#include "lwip/netdb.h"

#include "cy_lwip_dhcp_server.h"
#include "cy_network_mw_core.h"
#include "cy_result.h"
#include "cy_lwip_log.h"

#if defined(CYBSP_WIFI_CAPABLE)
    #include "cybsp_wifi.h"
    #include "cy_network_buffer.h"
    #include "whd.h"
    #include "whd_wifi_api.h"
    #include "whd_network_types.h"
    #include "whd_buffer_api.h"
    #include "cy_wifimwcore_eapol.h"
    #ifdef COMPONENT_4390X
        #include "whd_wlioctl.h"
    #endif
#endif

#if defined(CYBSP_ETHERNET_CAPABLE)
    #include "cy_internal.h"

    #ifdef COMPONENT_CAT3
        #include "xmc_gpio.h"
        #include "xmc_eth_mac.h"
        #include "xmc_eth_phy.h"
    #endif

    #ifdef COMPONENT_CAT1
        #include "cyabs_rtos.h"
        #include "cy_worker_thread.h"
    #endif

#endif

#if (1)
    #include "cy_crypto_core.h"
    #include "cy_crypto_core_trng_config.h"
#endif
/* While using lwIP/sockets errno is required. Since IAR, ARMC6 and LLVM doesn't define errno variable, the following definition is required for building it successfully. */
#if (!( (defined(__GNUC__) && !defined(__ARMCC_VERSION)) ) || defined(__llvm__))
    int errno;
#endif

/******************************************************
 *                      Macros
 ******************************************************/
/**
 * Suppress unused variable warning
 */
#define UNUSED_VARIABLE(x) ( (void)(x) )

#define EAPOL_PACKET_TYPE                        (0x888E)

#define MULTICAST_IP_TO_MAC(ip)                  {   (uint8_t) 0x01,             \
                                                     (uint8_t) 0x00,             \
                                                     (uint8_t) 0x5e,             \
                                                     (uint8_t) ((ip)[1] & 0x7F), \
                                                     (uint8_t) (ip)[2],          \
                                                     (uint8_t) (ip)[3]           \
                                                 }

#define IPV6_MULTICAST_TO_MAC_PREFIX             (0x33)

#define ARP_WAIT_TIME_IN_MSEC                    (30000)
#define ARP_CACHE_CHECK_INTERVAL_IN_MSEC         (5)

#define DHCP_IP_ADDRESS_RESOLUTION_TIMEOUT_IN_MS (15000)
#ifndef AUTO_IP_ADDRESS_RESOLUTION_TIMEOUT_IN_MS
    #define AUTO_IP_ADDRESS_RESOLUTION_TIMEOUT_IN_MS (60000 * 10)
#endif
#define DCHP_RENEWAL_DELAY_IN_MS                 (100)
#define DHCP_STOP_DELAY_IN_MS                    (400)
/**
 * Maximum number of interface instances supported
 */
#define CY_IFACE_MAX_HANDLE                      (4U)

#define MAX_AUTO_IP_RETRIES                      (5)

#ifdef COMPONENT_4390X
    #define CY_PRNG_SEED_FEEDBACK_MAX_LOOPS          (1000)
    #define CY_PRNG_CRC32_POLYNOMIAL                 (0xEDB88320)
    #define CY_PRNG_ADD_CYCLECNT_ENTROPY_EACH_N_BYTE (1024)
    #define CY_PRNG_WELL512_STATE_SIZE               (16)
#endif

/* Ping definitions*/
#define PING_DATA_SIZE                           (64)
#define PING_IF_NAME_LEN                         (6)
#define PING_RESPONSE_LEN                        (64)
#define PING_ID                                  (0xAFAF)  /** ICMP identifier for ping */

#define MAX_ETHERNET_PORT                        (2U)
#define ETH_INTERFACE_INDEX                      (2U)

#if defined(CYBSP_ETHERNET_CAPABLE)
    #ifdef COMPONENT_CAT1
        #define CM_RX_WORKER_THREAD_PRIORITY                  (CY_RTOS_PRIORITY_HIGH)
        #define CM_RX_WORKER_THREAD_STACK_SIZE                (4 * 1024)
        #define CM_RX_WORKER_THREAD_QUEUE_SIZE                (32)
        #define CM_TX_WORKER_THREAD_PRIORITY                  (CY_RTOS_PRIORITY_HIGH)
        #define CM_TX_WORKER_THREAD_STACK_SIZE                (4 * 1024)
        #define CM_TX_WORKER_THREAD_QUEUE_SIZE                (32)
    #endif
#endif

#if defined(COMPONENT_CAT1)
    #define MAX_TRNG_BIT_SIZE        (32UL)
#endif

/******************************************************
 *               Variable Definitions
 ******************************************************/
static cy_network_activity_event_callback_t activity_callback = NULL;
static bool is_dhcp_client_required = false;
#if defined(CYBSP_WIFI_CAPABLE)
    static cy_network_rx_queue_callback_t rx_queue_callback = NULL;
    static cy_wifimwcore_eapol_packet_handler_t internal_eapol_packet_handler = NULL;
#endif
static cy_network_ip_change_callback_t ip_change_callback = NULL;

#if LWIP_IPV4
    static cy_lwip_dhcp_server_t internal_dhcp_server;
#endif

/* Interface init status */
static bool ip_networking_inited[CY_IFACE_MAX_HANDLE];
#define SET_IP_NETWORK_INITED(interface_index, status)   (ip_networking_inited[(interface_index)&3] = status)

/* Interface UP status */
static bool ip_up[CY_IFACE_MAX_HANDLE];
#define SET_IP_UP(interface_index, status)               (ip_up[(interface_index)&3] = status)

struct  netif                                           *cy_lwip_ip_handle[CY_IFACE_MAX_HANDLE];
#define LWIP_IP_HANDLE(interface)                        (cy_lwip_ip_handle[(interface) & 3])

static struct netif       sta_ip_handle;
static struct netif       ap_ip_handle;
static struct netif       eth0_ip_handle;
static struct netif       eth1_ip_handle;

struct netif *cy_lwip_ip_handle[CY_IFACE_MAX_HANDLE] =
{
    [0] =  &sta_ip_handle,
    [1] =  &ap_ip_handle,
    [2] =  &eth0_ip_handle,
    [3] =  &eth1_ip_handle
};

struct icmp_packet
{
    struct   icmp_echo_hdr hdr;
    uint8_t  data[PING_DATA_SIZE];
};

cy_network_interface_context iface_context_database[CY_IFACE_MAX_HANDLE];
static uint8_t iface_count = 0;
static uint8_t connectivity_lib_init = 0;
static bool is_tcp_initialized       = false;

#ifdef COMPONENT_4390X
    static uint32_t prng_well512_state[CY_PRNG_WELL512_STATE_SIZE];
    static uint32_t prng_well512_index = 0;

    static uint32_t prng_add_cyclecnt_entropy_bytes = CY_PRNG_ADD_CYCLECNT_ENTROPY_EACH_N_BYTE;

    /** Mutex to protect the PRNG state array */
    static cy_mutex_t cy_prng_mutex;
    static cy_mutex_t *cy_prng_mutex_ptr;

#endif

#if defined(CYBSP_ETHERNET_CAPABLE)
    #ifdef COMPONENT_CAT1
        cy_worker_thread_info_t          cy_rx_worker_thread;
        cy_queue_t                       rx_input_buffer_queue;
        cy_worker_thread_info_t          cy_tx_worker_thread;
        cy_semaphore_t                   tx_semaphore = NULL;
        cy_mutex_t                       tx_mutex;
        static cy_internal_buffer_pool_t *rx_pool_handle = NULL;
        uint8_t *pRx_Q_buff_pool[CY_ETH_DEFINE_TOTAL_BD_PER_RXQUEUE];
    #endif
#endif

#if defined(COMPONENT_CAT1)
    /** mutex to protect trng count */
    static cy_mutex_t trng_mutex;
#endif

/******************************************************
 *               Static Function Declarations
 ******************************************************/
#if defined(CYBSP_ETHERNET_CAPABLE)
    extern err_t ethernetif_init(struct netif* netif);
#endif

