RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_network_mw_core.c
#if LWIP_IPV4
    static void invalidate_all_arp_entries(struct netif *netif);
#endif
static void internal_ip_change_callback(struct netif *netif);
static bool is_interface_added(uint8_t interface_index);
static cy_rslt_t is_interface_valid(cy_network_interface_context *iface);
static bool is_network_up(uint8_t interface_index);

#if LWIP_IPV4
    static void ping_prepare_echo(struct icmp_packet *iecho, uint16_t len, uint16_t *ping_seq_num);
    static err_t ping_send(int socket_hnd, const cy_nw_ip_address_t* address, struct icmp_packet *iecho, uint16_t *sequence_number);
    static err_t ping_recv(int socket_hnd, cy_nw_ip_address_t* address, uint16_t *ping_seq_num);
#endif

#ifdef COMPONENT_4390X
    static uint32_t prng_well512_get_random(void);
    static void     prng_well512_add_entropy(const void* buffer, uint16_t buffer_length);
    cy_rslt_t cy_prng_get_random(void* buffer, uint32_t buffer_length);
    cy_rslt_t cy_prng_add_entropy(const void* buffer, uint32_t buffer_length);
#endif

#if defined(COMPONENT_CAT1)
    static int cy_trng_release(void);
    static int cy_trng_reserve(void);
#endif

/******************************************************
 *               Function Definitions
 ******************************************************/

#if defined(CYBSP_WIFI_CAPABLE)
/*
 * This function takes packets from the radio driver and passes them into the
 * lwIP stack. If the stack is not initialized, or if the lwIP stack does not
 * accept the packet, the packet is freed (dropped). If the packet is of type EAPOL
 * and if the Extensible Authentication Protocol over LAN (EAPOL) handler is registered, the packet will be redirected to the registered
 * handler and should be freed by the EAPOL handler.
 */
void cy_network_process_ethernet_data(whd_interface_t iface, whd_buffer_t buf)
{
    uint8_t *data = whd_buffer_get_current_piece_data_pointer(iface->whd_driver, buf);
    uint16_t ethertype;
    struct netif *net_interface = NULL;

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "%s(): START iface->role:[%d]\n", __FUNCTION__, iface->role);

    if (iface->role == WHD_STA_ROLE)
    {
        net_interface = &sta_ip_handle;
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "STA net_interface:[%p] \n", net_interface);
    }
    else if (iface->role == WHD_AP_ROLE)
    {
        net_interface = &ap_ip_handle;
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "AP net_interface:[%p] \n", net_interface);
    }
    else
    {
        cy_buffer_release(buf, WHD_NETWORK_RX) ;
        return;
    }

    ethertype = (uint16_t)(data[12] << 8 | data[13]);
    if (ethertype == EAPOL_PACKET_TYPE)
    {
        if (internal_eapol_packet_handler != NULL)
        {
            internal_eapol_packet_handler(iface, buf);
        }
        else
        {
            cy_buffer_release(buf, WHD_NETWORK_RX) ;
        }
    }
    else
    {
        /* Call the registered activity handler with the argument as false
         * indicating that there is RX packet
         */
        if (activity_callback)
        {
            activity_callback(false);
        }

        if (rx_queue_callback)
        {
            /* rx_queue_callback will be registered only when the network stack is being suspended.
             * This will help to queue the incoming packets during the wake sequence until
             * the network stack is ready to accept and process packets. */
            rx_queue_callback((void*)net_interface, (void*)buf);
            return;
        }

        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Send data up to LwIP \n");
        /* If the interface is not yet set up, drop the packet */
        if (net_interface->input == NULL || net_interface->input(buf, net_interface) != ERR_OK)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Drop packet before lwip \n");
            cy_buffer_release(buf, WHD_NETWORK_RX) ;
        }
    }
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__);
}

/* Create a duplicate pbuf of the input pbuf */
static struct pbuf *pbuf_dup(const struct pbuf *orig)
{
    struct pbuf *p = pbuf_alloc(PBUF_LINK, orig->tot_len, PBUF_RAM);
    if (p != NULL)
    {
        pbuf_copy(p, orig);
        p->flags = orig->flags;
    }
    return p;
}

/*
 * This function takes the packets from the lwIP stack and sends them down to the radio.
 * If the radio is not ready, return and error; otherwise, add a reference to
 * the packet for the radio driver and send the packet to the radio driver. The radio
 * driver puts the packet into a send queue and sends it based on another thread. This
 * other thread will release the packet reference once the packet is actually sent.
 */
static err_t wifioutput(struct netif *iface, struct pbuf *p)
{
    cy_network_interface_context *if_ctx;
    if_ctx = (cy_network_interface_context *)iface->state;

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__);

    if (whd_wifi_is_ready_to_transceive((whd_interface_t)if_ctx->hw_interface) != WHD_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Wi-Fi is not ready, packet not sent\n");
        return ERR_INPROGRESS ;
    }

    struct pbuf *whd_buf = pbuf_dup(p);
    if (whd_buf == NULL)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to allocate buffer for outgoing packet\n");
        return ERR_MEM;
    }
    /* Call the registered activity handler with the argument as true
     * indicating there is TX packet
     */
    if (activity_callback)
    {
        activity_callback(true);
    }
    whd_network_send_ethernet_data((whd_interface_t)if_ctx->hw_interface, whd_buf) ;

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__);

    return ERR_OK ;
}


#if LWIP_IPV4 && LWIP_IGMP
/*
 * Respond to IGMP (group management) requests
 */
static err_t igmp_filter(struct netif *iface, const ip4_addr_t *group, enum netif_mac_filter_action action)
{
    cy_network_interface_context *if_ctx;
    if_ctx = (cy_network_interface_context *)iface->state;

    whd_mac_t mac = { MULTICAST_IP_TO_MAC((uint8_t*)group) };

