RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_network_mw_core.c
    switch (action)
    {
    case NETIF_ADD_MAC_FILTER:
        if (whd_wifi_register_multicast_address((whd_interface_t)if_ctx->hw_interface, &mac) != CY_RSLT_SUCCESS)
        {
            return ERR_VAL;
        }
        break;

    case NETIF_DEL_MAC_FILTER:
        if (whd_wifi_unregister_multicast_address((whd_interface_t)if_ctx->hw_interface, &mac) != CY_RSLT_SUCCESS)
        {
            return ERR_VAL;
        }
        break;

    default:
        return ERR_VAL;
    }

    return ERR_OK;
}
#endif

#if LWIP_IPV6 && LWIP_IPV6_MLD
/*
 * Function called by the lwIP stack to add or delete an entry in the IPv6 multicast filter table of the Ethernet MAC.
 */
static err_t mld_mac_filter(struct netif *iface, const ip6_addr_t *group, enum netif_mac_filter_action action)
{
    whd_mac_t macaddr;
    cy_rslt_t res;
    const uint8_t *ptr = (const uint8_t *)group->addr;
    cy_network_interface_context *if_ctx;
    if_ctx = (cy_network_interface_context *)iface->state;

    /* Convert the IPv6 multicast address to the MAC address.
     * The first two octets of the converted MAC address are fixed values (0x33 and 0x33).
     * The last four octets are the last four octets of the IPv6 multicast address.
     */
    macaddr.octet[0] = IPV6_MULTICAST_TO_MAC_PREFIX ;
    macaddr.octet[1] = IPV6_MULTICAST_TO_MAC_PREFIX ;
    macaddr.octet[2] = ptr[12] ;
    macaddr.octet[3] = ptr[13] ;
    macaddr.octet[4] = ptr[14] ;
    macaddr.octet[5] = ptr[15] ;

    switch (action)
    {
    case NETIF_ADD_MAC_FILTER:
        res = whd_wifi_register_multicast_address((whd_interface_t)if_ctx->hw_interface, &macaddr);
        if (res != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "whd_wifi_register_multicast_address call failed, err = %lx\n", res);
            return ERR_VAL;
        }
        break;

    case NETIF_DEL_MAC_FILTER:
        res = whd_wifi_unregister_multicast_address((whd_interface_t)if_ctx->hw_interface, &macaddr);
        if (res != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "whd_wifi_unregister_multicast_address call failed, err = %lx\n", res);
            return ERR_VAL;
        }
        break;

    default:
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid MAC Filter Action: %d\n", action);
        return ERR_VAL;
    }

    return ERR_OK;
}
#endif

/*
 * This function is called when adding the Wi-Fi network interface to lwIP,
 * it actually performs the initialization for the netif interface.
 */
static err_t wifiinit(struct netif *iface)
{
    cy_rslt_t res;
    cy_network_interface_context *if_ctx;
    if_ctx = (cy_network_interface_context *)iface->state;

    whd_mac_t macaddr;
    whd_interface_t whd_iface = (whd_interface_t)if_ctx->hw_interface;
#ifdef COMPONENT_4390X
    uint8_t buffer[WLC_GET_RANDOM_BYTES];
    uint32_t *wlan_rand = NULL;
#endif

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__);
    /*
     * Set the MAC address of the interface
     */
    res = whd_wifi_get_mac_address(whd_iface, &macaddr);

    if (res != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "whd_wifi_get_mac_address call failed, err = %lx\n", res);
        return res ;
    }
    memcpy(&iface->hwaddr, &macaddr, sizeof(macaddr));
    iface->hwaddr_len = sizeof(macaddr);

#ifdef COMPONENT_4390X
    /*
     * CYW43907 kits do not have the TRNG module. Get a random number from the WLAN and feed
     * it as a seed to the PRNG function.
     * Before invoking whd_wifi_get_iovar_buffer, WHD interface should be initialized.
     * However, wcminit is called from cy_lwip_add_interface; the WHD interface is an
     * input to the cy_lwip_add_interface API. So it is safe to invoke
     * whd_wifi_get_iovar_buffer here.
     */
    if (WHD_SUCCESS != whd_wifi_get_iovar_buffer(whd_iface, IOVAR_STR_RAND, buffer, WLC_GET_RANDOM_BYTES))
    {
        return ERR_IF;
    }
    wlan_rand = (uint32_t *)buffer;

    /* Initialize the mutex to protect the PRNG WELL512 state */
    if (cy_prng_mutex_ptr == NULL)
    {
        cy_prng_mutex_ptr = &cy_prng_mutex;
        cy_rtos_init_mutex(cy_prng_mutex_ptr);
    }
    /* Feed the random number obtained from the WLAN to the WELL512
     * algorithm as the initial seed value.
     */
    cy_prng_add_entropy((const void *)wlan_rand, 4);
#endif
    /*
     * Set up the information associated with sending packets
     */
#if LWIP_IPV4
    iface->output = etharp_output;
#endif
    iface->linkoutput = wifioutput;
    iface->mtu = WHD_LINK_MTU;
    iface->flags |= (NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP | NETIF_FLAG_IGMP) ;
#if LWIP_IPV6_MLD
    iface->flags |= NETIF_FLAG_MLD6;
#endif
    /*
     * Set the interface name for the interface
     */
    iface->name[0] = 'w' ;
    iface->name[1] = 'l' ;

#if LWIP_IPV4 && LWIP_IGMP
    netif_set_igmp_mac_filter(iface, igmp_filter) ;
#endif


#if LWIP_IPV6 == 1
    /*
     * Filter the output packets for IPv6 through the Ethernet output
     * function for IPv6
     */
    iface->output_ip6 = ethip6_output ;

    /*
     * Automatically generate a unicast IP address based on
     * neighbor discovery
     */
    iface->ip6_autoconfig_enabled = 1 ;

    /*
     * Create a link-local IPv6 address
     */
    netif_create_ip6_linklocal_address(iface, 1);

    /*
     * Tell the radio that you want to listen to solicited-node multicast
     * packets. These packets are part of the IPv6 neighbor discovery
     * process.
     */
    macaddr.octet[0] = 0x33 ;
    macaddr.octet[1] = 0x33 ;
    macaddr.octet[2] = 0xff ;
    whd_wifi_register_multicast_address((whd_interface_t)if_ctx->hw_interface, &macaddr) ;

    /*
     * Tell the radio that you want to listen to the multicast address
     * that targets all IPv6 devices. These packets are part of the IPv6
     * neighbor discovery process.
     */
    memset(&macaddr, 0, sizeof(macaddr)) ;
    macaddr.octet[0] = 0x33 ;
    macaddr.octet[1] = 0x33 ;
    macaddr.octet[5] = 0x01 ;
    whd_wifi_register_multicast_address((whd_interface_t)if_ctx->hw_interface, &macaddr) ;

#if LWIP_IPV6_MLD
    /*
     * Register the MLD MAC filter callback function that will be called by the lwIP stack to add or delete an
     * entry in the IPv6 multicast filter table of the Ethernet MAC
     */
    netif_set_mld_mac_filter(iface, mld_mac_filter);
#endif
#endif

