RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_network_mw_core.c
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__);
    return 0 ;
}
#endif

#if defined(CYBSP_ETHERNET_CAPABLE)
#ifdef COMPONENT_CAT1
static cy_rslt_t cy_buffer_pool_create(uint32_t no_of_buffers, uint32_t sizeof_buffer, cy_internal_buffer_pool_t **handle)
{
    uint16_t header_size;
    uint8_t *data_buffer = NULL;
    uint8_t *data_buffer_aligned = NULL;

    int count = 1;
    list_node_t *current_node = NULL;

    /* Allocate memory for the pool handle */
    cy_internal_buffer_pool_t *pool_handle = calloc(1, sizeof(cy_internal_buffer_pool_t));
    if (NULL == pool_handle)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Failed to allocate memory for buffer pool manager handle\n");
        return CY_RSLT_NETWORK_ERROR_NOMEM;
    }
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Buf pool handle : [%0x]\n", pool_handle);

    header_size = sizeof(list_node_t);

    /* Allocate memory for the actual buffer. Allocate additional MEM_BYTE_ALIGNMENT bytes to accommodate if the pointer returned is not 32 byte aligned */
    data_buffer = malloc((no_of_buffers * sizeof_buffer) + (header_size * no_of_buffers) + MEM_BYTE_ALIGNMENT);
    if (NULL == data_buffer)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Failed to allocate memory for actual data\n");
        free(pool_handle);
        return CY_RSLT_NETWORK_ERROR_NOMEM;
    }
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Base address of allocated buffer : [%0x] sizeof(list_node_t):[%d]\n", data_buffer, sizeof(list_node_t));

    pool_handle->total_num_buf_created = no_of_buffers;
    pool_handle->sizeof_buffer = sizeof_buffer;
    pool_handle->data_buffer = data_buffer;
    pool_handle->head = NULL;

    /* Update the allocated data_buffer pointer to be 32 byte aligned */
    data_buffer_aligned = (uint8_t*)((size_t)data_buffer + ((size_t)MEM_BYTE_ALIGNMENT - ((size_t)data_buffer & 0x1F)));
    /* Iterate over and build up the chain of buffers */
    while (count <= no_of_buffers)
    {
        list_node_t *node = (list_node_t*) data_buffer_aligned;

        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Creating buffer no [%d]....\n", count);

        node->pool_handle = pool_handle;
        node->next = NULL;
        node->buffer_ptr = data_buffer_aligned + header_size;

        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Buffer node addr : [%0x], actual buffer addr : [%0x]\n", node, node->buffer_ptr);

        /* If the first node should be added to the list, change the head pointer */
        if (pool_handle->head == NULL)
        {
            pool_handle->head = node;
            current_node = node;
        }
        else
        {
            current_node->next = node;
            current_node = node;
        }

        data_buffer_aligned += sizeof_buffer + header_size;

        count++;
    }

    *handle = pool_handle;

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t cy_buffer_pool_get(cy_buffer_t *buffer, cy_internal_buffer_pool_t *pool_handle)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    list_node_t *list_node = NULL;

    /* If there are no free available buffer in the list, then return error */
    if (pool_handle->head == NULL)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "No available buffers");
        return CY_RSLT_NETWORK_ERROR_NOMEM;
    }
    else
    {
        list_node = pool_handle->head;
        /* Make the free available node as head */
        pool_handle->head = list_node->next;

        *buffer = (void *)list_node->buffer_ptr;
    }
    return result;
}

static void cy_buffer_pool_delete(cy_internal_buffer_pool_t *pool_handle)
{
    free(pool_handle->data_buffer);
    free(pool_handle);
    pool_handle = NULL;
}
#endif
#endif

cy_rslt_t cy_network_init(void)
{
#if defined(CYBSP_ETHERNET_CAPABLE)
#ifdef COMPONENT_CAT1
    cy_worker_thread_params_t params;
    cy_buffer_t get_buffer = NULL;
    uint8_t *pbuffer = NULL;
    cy_rx_buffer_info_t *rx_info;
    cy_rslt_t result;
#endif
#endif
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__);

    if (connectivity_lib_init)
    {
        connectivity_lib_init++;
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n Connectivity library is already initialized.\n");
        return CY_RSLT_SUCCESS;
    }

    /** Initialize TCP ip stack, LWIP init is called through tcpip_init **/
    if (!is_tcp_initialized)
    {
        /*Network stack initialization*/
        tcpip_init(NULL, NULL);
        is_tcp_initialized = true;
    }

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n tcpip_init success.\n");

    /*Memory to store iface_context. Currently, 4 contexts*/
    for (int i = 0; i < CY_IFACE_MAX_HANDLE; i++)
    {
        memset(&(iface_context_database[i]), 0, sizeof(cy_network_interface_context));
    }

#if defined(CYBSP_ETHERNET_CAPABLE)
#ifdef COMPONENT_CAT1

    /* Create the RX worker thread */
    memset(&params, 0, sizeof(params));
    params.name = "ETH_RX_Worker";
    params.priority = CM_RX_WORKER_THREAD_PRIORITY;
    params.stack = NULL;
    params.stack_size = CM_RX_WORKER_THREAD_STACK_SIZE;
    params.num_entries = CM_RX_WORKER_THREAD_QUEUE_SIZE;

    if (cy_worker_thread_create(&cy_rx_worker_thread, &params) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "worker thread creation failed \n");
        return CY_RSLT_NETWORK_ERROR_RTOS;
    }

    if (cy_rtos_init_queue(&rx_input_buffer_queue, ETH_RX_NO_OF_BUFFERS, sizeof(uint32_t)) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Failed to initialize queue to store input free buffers\n");
        cy_worker_thread_delete(&cy_rx_worker_thread);
        return CY_RSLT_NETWORK_ERROR_RTOS;
    }

    if (cy_buffer_pool_create(ETH_RX_NO_OF_BUFFERS, (sizeof(cy_rx_buffer_info_t) + CY_ETH_SIZE_MAX_FRAME), &rx_pool_handle) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Failed to create buffer pool\n");
        cy_rtos_deinit_queue(&rx_input_buffer_queue);
        cy_worker_thread_delete(&cy_rx_worker_thread);
        return CY_RSLT_NETWORK_ERROR_NOMEM;
    }

