RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_network_mw_core.c
    /* Initialize tx mutex */
    if (cy_rtos_init_mutex(&tx_mutex) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\n cy_rtos_init_mutex failed\n");
        cy_buffer_pool_delete(rx_pool_handle);
        cy_rtos_deinit_queue(&rx_input_buffer_queue);
        cy_worker_thread_delete(&cy_rx_worker_thread);
        return CY_RSLT_NETWORK_ERROR_RTOS;
    }

    /* Initialize tx semaphore */
    if (cy_rtos_init_semaphore(&tx_semaphore, 1, 0) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\n cy_rtos_init_semaphore failed\n");
        cy_rtos_deinit_mutex(&tx_mutex);
        cy_buffer_pool_delete(rx_pool_handle);
        cy_rtos_deinit_queue(&rx_input_buffer_queue);
        cy_worker_thread_delete(&cy_rx_worker_thread);
        return CY_RSLT_NETWORK_ERROR_RTOS;
    }

    /* Create a worker thread for handling TX callback events */
    memset(&params, 0, sizeof(params));
    params.name = "ETH_TX_Worker";
    params.priority = CM_TX_WORKER_THREAD_PRIORITY;
    params.stack = NULL;
    params.stack_size = CM_TX_WORKER_THREAD_STACK_SIZE;
    params.num_entries = CM_TX_WORKER_THREAD_QUEUE_SIZE;

    /* Create a worker thread */
    if (cy_worker_thread_create(&cy_tx_worker_thread, &params) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "worker thread creation failed \n");
        cy_rtos_deinit_semaphore(&tx_semaphore);
        cy_rtos_deinit_mutex(&tx_mutex);
        cy_buffer_pool_delete(rx_pool_handle);
        cy_rtos_deinit_queue(&rx_input_buffer_queue);
        cy_worker_thread_delete(&cy_rx_worker_thread);
        return CY_RSLT_NETWORK_ERROR_RTOS;
    }

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Get all the buffers from pool and push to rx queue\n");

    for (int i = 0; i < rx_pool_handle->total_num_buf_created; i++)
    {
        /* Get the buffer from pool */
        if (cy_buffer_pool_get(&get_buffer, rx_pool_handle) != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Failed to get the buffer from pool\n");
            result = CY_RSLT_NETWORK_ERROR_NOMEM;
            goto exit;
        }

        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Buffer from pool : [%p]\n", get_buffer);

        /* Push the free buffer to the queue */
        if (cy_rtos_put_queue(&rx_input_buffer_queue, &get_buffer, CY_RTOS_NEVER_TIMEOUT, false) != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Failed to push the free buffer to queue\n");
            result = CY_RSLT_NETWORK_ERROR_RTOS;
            goto exit;
        }
    }

    for (int i = 0; i < CY_ETH_DEFINE_TOTAL_BD_PER_RXQUEUE; i++)
    {
        if (cy_rtos_get_queue(&rx_input_buffer_queue, (void *)&pbuffer, 0, true) != CY_RSLT_SUCCESS)
        {
            /* Failed to get a free buffer from the queue. */
            result = CY_RSLT_NETWORK_ERROR_RTOS;
            goto exit;
        }

        rx_info = (cy_rx_buffer_info_t *)pbuffer;
        rx_info->rx_data_ptr = (uint8_t *)(pbuffer + sizeof(cy_rx_buffer_info_t));

        pRx_Q_buff_pool[i] = (uint8_t *)&rx_info->rx_data_ptr;
    }
#endif
#endif

#if defined(COMPONENT_CAT1)
    if (cy_rtos_init_mutex(&trng_mutex) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "\n cy_rtos_init_mutex failed\n");
#if defined(CYBSP_ETHERNET_CAPABLE)
        result = CY_RSLT_NETWORK_ERROR_NOMEM;
        goto exit;
#else
        return CY_RSLT_NETWORK_ERROR_NOMEM;
#endif
    }
#endif
    connectivity_lib_init++;

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__);
    return CY_RSLT_SUCCESS;

#if defined(CYBSP_ETHERNET_CAPABLE)
#ifdef COMPONENT_CAT1

exit:
    cy_worker_thread_delete(&cy_tx_worker_thread);
    cy_rtos_deinit_semaphore(&tx_semaphore);
    cy_rtos_deinit_mutex(&tx_mutex);
    cy_buffer_pool_delete(rx_pool_handle);
    cy_rtos_deinit_queue(&rx_input_buffer_queue);
    cy_worker_thread_delete(&cy_rx_worker_thread);
    return result;

#endif
#endif
}

cy_rslt_t cy_network_deinit(void)
{

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__);

    if (connectivity_lib_init == 0)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n Connectivity library is De-initialized.\n");
        return CY_RSLT_SUCCESS;
    }
    else
    {
        connectivity_lib_init--;
        if (connectivity_lib_init == 0)
        {

#if defined(CYBSP_ETHERNET_CAPABLE)
#ifdef COMPONENT_CAT1
            /* Delete the rx worker thread */
            cy_worker_thread_delete(&cy_rx_worker_thread);

            /* Delete the rx queue */
            cy_rtos_deinit_queue(&rx_input_buffer_queue);

            /* Delete the rx pool */
            cy_buffer_pool_delete(rx_pool_handle);

            /* Delete the tx worker thread */
            cy_worker_thread_delete(&cy_tx_worker_thread);

            /* Delete the tx semaphore */
            cy_rtos_deinit_semaphore(&tx_semaphore);

            /* Delete the tx mutex */
            cy_rtos_deinit_mutex(&tx_mutex);

#endif
#endif

#ifdef COMPONENT_CAT1
            cy_rtos_deinit_mutex(&trng_mutex);
#endif
        }
    }

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_network_add_nw_interface(cy_network_hw_interface_type_t iface_type, uint8_t iface_idx,
                                      void *hw_interface, uint8_t *mac_address,
                                      cy_network_static_ip_addr_t *static_ipaddr,
                                      cy_network_interface_context **iface_context)
{
    bool iface_found = false;
    uint8_t index = 0;
    uint8_t eth_index = iface_idx;
#if LWIP_IPV4
    ip4_addr_t ipaddr, netmask, gateway ;
#endif

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__);

    if (iface_context == NULL || hw_interface == NULL || (iface_idx >= MAX_ETHERNET_PORT))
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Bad arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    if (iface_count >= CY_IFACE_MAX_HANDLE)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error adding interface \n");
        return CY_RSLT_NETWORK_ERROR_ADDING_INTERFACE;
    }

    /* Static IP address is mandatory for AP */
    if ((iface_type == CY_NETWORK_WIFI_AP_INTERFACE) && (static_ipaddr == NULL))
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error static IP addr cannot be NULL for AP interface \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    /*Check if the interface is already added*/
    for (int i = 0; i < CY_IFACE_MAX_HANDLE; i++)
    {
        if ((iface_context_database[i].is_initialized == true) &&
                (iface_context_database[i].iface_type == iface_type) &&
                (iface_context_database[i].iface_idx == iface_idx))
        {
            iface_found = true;
            *iface_context = &(iface_context_database[i]);

            break;
        }
    }

