RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_network_mw_core.c
    if (iface_found == true)
    {
        iface_idx = ((iface_type == CY_NETWORK_ETH_INTERFACE) ? (CY_NETWORK_ETH_INTERFACE + iface_idx) : iface_type);
        if (is_interface_added((uint8_t)iface_idx))
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Interface already exists \n");
            return CY_RSLT_NETWORK_INTERFACE_EXISTS;
        }
    }
    else
    {
        /*No duplicate; check for an available index and update the interface database*/
        for (index = 0; index < CY_IFACE_MAX_HANDLE; index++)
        {
            if (iface_context_database[index].is_initialized == false)
            {
                iface_context_database[index].iface_type = iface_type;
                iface_context_database[index].iface_idx  = iface_idx;

                iface_context_database[index].hw_interface = hw_interface;
                cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, " Adding interface \n");

                *iface_context = &(iface_context_database[index]);
                break;
            }
        }

        /* Handling index out of bound exception */
        if (index == 4)
        {
            return CY_RSLT_NETWORK_BAD_ARG;
        }
    }

#if LWIP_IPV4
    /* Assign the IP address if static; otherwise, zero the IP address */
    if (static_ipaddr != NULL)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "static_ipaddr is NOT NULL \n");

#ifdef ENABLE_CONNECTIVITY_MIDDLEWARE_LOGS
#define IPV4_MAX_STR_LEN 15
        char ip_str[IPV4_MAX_STR_LEN];
        cy_nw_ntoa(&(static_ipaddr->addr), ip_str);
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "static ipaddr assigned %s assigned \n", ip_str);
        cy_nw_ntoa(&(static_ipaddr->gateway), ip_str);
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "static gateway assigned %s assigned \n", ip_str);
        cy_nw_ntoa(&(static_ipaddr->netmask), ip_str);
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "static netmask assigned %s assigned \n", ip_str);
#endif

        memcpy(&gateway, &static_ipaddr->gateway.ip.v4, sizeof(gateway));
        memcpy(&ipaddr, &static_ipaddr->addr.ip.v4, sizeof(ipaddr));
        memcpy(&netmask, &static_ipaddr->netmask.ip.v4, sizeof(netmask));
    }
    else
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "static_ipaddr from application API is NULL \n");
        memset(&gateway, 0, sizeof(gateway));
        memset(&ipaddr, 0, sizeof(ipaddr));
        memset(&netmask, 0, sizeof(netmask));
    }

    /* Set static IP from the device configurator. If static IP is set from both application
     * API and device configurator then device configurator parameters will take the precedence */
    if (eth_index == 0)
    {
        /* Add interface is called for ETH0 */
#if (defined(CYBSP_ETHERNET_CAPABLE))
#if (defined(eth_0_STATIC_IP) && (eth_0_STATIC_IP == 1u))
        /* Static IP from device configurator enabled. Configure static IP to network stack */
        uint32_t gw_addr = (uint32_t)eth_0_GATEWAY_IP_ADDR;
        uint32_t ip_addr = (uint32_t)eth_0_IP_ADDR;
        uint32_t subnet_mk = (uint32_t)eth_0_SUBNET_MASK;
        memcpy(&gateway, &gw_addr, sizeof(gateway));
        memcpy(&ipaddr, &ip_addr, sizeof(ipaddr));
        memcpy(&netmask, &subnet_mk, sizeof(netmask));
#else
        /* Static IP from device configurator disabled. Configure DHCP to network stack */
        memset(&gateway, 0, sizeof(gateway));
        memset(&ipaddr, 0, sizeof(ipaddr));
        memset(&netmask, 0, sizeof(netmask));
#endif
    }
    else
    {
        /* Add interface is called for ETH1 */
#if (defined(eth_1_STATIC_IP) && (eth_1_STATIC_IP == 1u))
        /* Static IP from device configurator enabled. Configure static IP to network stack */
        uint32_t gw_addr = (uint32_t)eth_1_GATEWAY_IP_ADDR;
        uint32_t ip_addr = (uint32_t)eth_1_IP_ADDR;
        uint32_t subnet_mk = (uint32_t)eth_1_SUBNET_MASK;
        memcpy(&gateway, &gw_addr, sizeof(gateway));
        memcpy(&ipaddr, &ip_addr, sizeof(ipaddr));
        memcpy(&netmask, &subnet_mk, sizeof(netmask));
#else
        /* Static IP from device configurator disabled. Configure DHCP to network stack */
        memset(&gateway, 0, sizeof(gateway));
        memset(&ipaddr, 0, sizeof(ipaddr));
        memset(&netmask, 0, sizeof(netmask));
#endif
#endif
    }
#endif

    /* update netif structure */
#if defined(CYBSP_WIFI_CAPABLE)
    if (CY_NETWORK_WIFI_STA_INTERFACE == iface_context_database[index].iface_type || CY_NETWORK_WIFI_AP_INTERFACE == iface_context_database[index].iface_type)
    {
        /* Assign network instance to the iface database */
        iface_context_database[index].nw_interface = LWIP_IP_HANDLE(iface_context_database[index].iface_type);
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "iface_context_database[index].nw_interface:[%p]\n", iface_context_database[index].nw_interface);

        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "iface_context_database[index].hw_interface:[%p] hw_interface:[%p]\n", iface_context_database[index].hw_interface, hw_interface);
#if LWIP_IPV4
        /* Add the interface to the lwIP stack and make it the default */
        if (netifapi_netif_add(iface_context_database[index].nw_interface, &ipaddr, &netmask, &gateway, &iface_context_database[index], wifiinit, tcpip_input) != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error adding interface \n");
            return CY_RSLT_NETWORK_ERROR_ADDING_INTERFACE;
        }
#else
        if (netifapi_netif_add(iface_context_database[index].nw_interface, &iface_context_database[index], wifiinit, tcpip_input) != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error adding interface \n");
            return CY_RSLT_NETWORK_ERROR_ADDING_INTERFACE;
        }
#endif
    }

    if (iface_context_database[index].iface_type == CY_NETWORK_WIFI_STA_INTERFACE)
    {
        if (static_ipaddr == NULL)
        {
            is_dhcp_client_required = true;
        }
        netifapi_netif_set_default(iface_context_database[index].nw_interface);
    }

#if LWIP_NETIF_STATUS_CALLBACK == 1
    /*
     * Register a handler for any address changes.
     * Note: The "status" callback will also be called when the interface
     * goes up or down.
     */
    netif_set_status_callback(iface_context_database[index].nw_interface, internal_ip_change_callback);
#endif /* LWIP_NETIF_STATUS_CALLBACK */

    SET_IP_NETWORK_INITED(iface_context_database[index].iface_type, true);

#endif

#if defined(CYBSP_ETHERNET_CAPABLE)
    if (CY_NETWORK_ETH_INTERFACE == iface_context_database[index].iface_type)
    {
        /* Update the MAC address to iface database */
        memcpy((uint8_t *) & (iface_context_database[index].mac_address[0]), (uint8_t *)mac_address, CY_MAC_ADDR_LEN);

