RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_network_mw_core.c
                /*
                 * If LPA is enabled, invoke the activity callback to resume the network stack
                 * before invoking the lwIP APIs that require the TCP core lock.
                 */
                if (activity_callback)
                {
                    activity_callback(true);
                }

                if (autoip_start(LWIP_IP_HANDLE(interface_index)) != ERR_OK)
                {
                    /* trick: Skip the while-loop, do the cleaning up stuff */
                    timeout_occurred = true;
                }

                while ((timeout_occurred == false) && ((netif_autoip_data(LWIP_IP_HANDLE(interface_index))->state != AUTOIP_STATE_BOUND)))
                {
                    cy_rtos_delay_milliseconds(10);
                    address_resolution_timeout += 10;
                    if (address_resolution_timeout >= AUTO_IP_ADDRESS_RESOLUTION_TIMEOUT_IN_MS)
                    {
                        if (tries++ < MAX_AUTO_IP_RETRIES)
                        {
                            address_resolution_timeout = 0;
                        }
                        else
                        {
                            timeout_occurred = true;
                        }
                    }
                }

                if (timeout_occurred)
                {
                    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to obtain IP address via DCHP and AutoIP\n");

                    /*
                     * If LPA is enabled, invoke the activity callback to resume the network stack
                     * before invoking the lwIP APIs that require the TCP core lock.
                     */
                    if (activity_callback)
                    {
                        activity_callback(true);
                    }

                    autoip_stop(LWIP_IP_HANDLE(interface_index));
                    return CY_RSLT_NETWORK_DHCP_WAIT_TIMEOUT;
                }
                else
                {
                    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "IP address obtained through AutoIP \n");
                }
#else
                cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "CY_RSLT_NETWORK_DHCP_WAIT_TIMEOUT error\n");
                return CY_RSLT_NETWORK_DHCP_WAIT_TIMEOUT;
#endif
            }
        }
    }
    else
    {
        memset(&internal_dhcp_server, 0, sizeof(internal_dhcp_server));
#if LWIP_IGMP
        igmp_start(LWIP_IP_HANDLE(interface_index));
#endif
        /* Start the internal DHCP server */
        if ((result = cy_lwip_dhcp_server_start(&internal_dhcp_server, iface)) != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to obtain IP address via DHCP\n");
            return CY_RSLT_NETWORK_ERROR_STARTING_DHCP;
        }
    }
#endif

    SET_IP_UP(interface_index, true);

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__);
    return result;
}

cy_rslt_t cy_network_ip_down(cy_network_interface_context *iface)
{
    uint8_t interface_index;

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__);

    if (is_interface_valid(iface) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    interface_index = (uint8_t)((iface->iface_type == CY_NETWORK_ETH_INTERFACE) ? (CY_NETWORK_ETH_INTERFACE + iface->iface_idx) : iface->iface_type);

    if (!is_network_up((uint8_t)interface_index))
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Network is not UP \r\n");
        return CY_RSLT_NETWORK_INTERFACE_NETWORK_NOT_UP;
    }

#if LWIP_IPV4
    if (is_dhcp_client_required)
    {
#if LWIP_AUTOIP
        if (netif_autoip_data(LWIP_IP_HANDLE(interface_index))->state == AUTOIP_STATE_BOUND)
        {
            /*
             * If LPA is enabled, invoke the activity callback to resume the network stack
             * before invoking the lwIP APIs that require the TCP core lock.
             */
            if (activity_callback)
            {
                activity_callback(true);
            }

            autoip_stop(LWIP_IP_HANDLE(interface_index));
        }
        else
#endif
        {
            /*
             * If LPA is enabled, invoke the activity callback to resume the network stack
             * before invoking the lwIP APIs that require the TCP core lock.
             */
            if (activity_callback)
            {
                activity_callback(true);
            }

            // netifapi_dhcp_release_and_stop(LWIP_IP_HANDLE(interface_index));
            cy_rtos_delay_milliseconds(DHCP_STOP_DELAY_IN_MS);

            /*
             * If LPA is enabled, invoke the activity callback to resume the network stack
             * before invoking the lwIP APIs that require the TCP core lock.
             */
            if (activity_callback)
            {
                activity_callback(true);
            }

            dhcp_cleanup(LWIP_IP_HANDLE(interface_index));
        }
    }

    if (iface->iface_type == CY_NETWORK_WIFI_AP_INTERFACE)
    {

        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Stop DHCP for SoftAP interface \n");
        /* Stop the internal DHCP server for the SoftAP interface */
        cy_lwip_dhcp_server_stop(&internal_dhcp_server);
    }
#endif

    /*
     * If LPA is enabled, invoke the activity callback to resume the network stack
     * before invoking the lwIP APIs that require the TCP core lock.
     */
    if (activity_callback)
    {
        activity_callback(true);
    }

    /*
    * Bring down the network link layer
    */
    netifapi_netif_set_link_down(LWIP_IP_HANDLE(interface_index));

    /*
    * Bring down the network interface
    */
    netifapi_netif_set_down(LWIP_IP_HANDLE(interface_index));

    /* TO DO : clear all ARP cache */

    /** TO DO:
     *  Kick the radio chip if it is in power save mode if the link down event is due to missing beacons.
     *  Setting the chip to the same power save mode is sufficient.
     */
    SET_IP_UP(interface_index, false);

