RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_network_mw_core.c
    if ((mac_addr == NULL) || (is_interface_valid(iface_context) != CY_RSLT_SUCCESS))
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    net_interface = (struct netif *)(iface_context->nw_interface);

    if (cy_network_get_gateway_ip_address(iface_context, &gateway_ip_addr) != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_network_get_gateway_ip_address failed\n");
        return  CY_RSLT_NETWORK_ERROR_GET_MAC_ADDR;
    }

    ipv4addr.addr = gateway_ip_addr.ip.v4;

    /* Check if the gateway address entry is already present in the ARP cache */
    arp_index = etharp_find_addr(net_interface, (const ip4_addr_t *) &ipv4addr, &eth_ret, (const ip4_addr_t **) &ip_ret);
    if (arp_index == -1)
    {
        /* Address entry is not present in the ARP cache. Send the ARP request.*/
        err = etharp_request(net_interface, (const ip4_addr_t *) &ipv4addr);
        if (err != ERR_OK)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "etharp_request failed with error %d\n", err);
            return  CY_RSLT_NETWORK_ERROR_GET_MAC_ADDR;
        }

        do
        {
            arp_index = etharp_find_addr(net_interface, (const ip4_addr_t *) &ipv4addr, &eth_ret, (const ip4_addr_t **) &ip_ret);
            if (arp_index != -1)
            {
                cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "arp entry found \r\n");
                break;
            }
            cy_rtos_delay_milliseconds(ARP_CACHE_CHECK_INTERVAL_IN_MSEC);
            arp_waittime -= ARP_CACHE_CHECK_INTERVAL_IN_MSEC;
            if (arp_waittime <= 0)
            {
                cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Could not resolve MAC address for the given destination address \r\n");
                return CY_RSLT_NETWORK_ERROR_GET_MAC_ADDR;
            }
        }
        while (1);

    }

    memcpy(mac_addr, eth_ret->addr, CY_MAC_ADDR_LEN);

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__);
    return CY_RSLT_SUCCESS;
#else
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() LWIP_IPV4 flag is not enabled \n", __FUNCTION__);
    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

cy_rslt_t cy_network_get_netmask_address(cy_network_interface_context *iface_context, cy_nw_ip_address_t *net_mask_addr)
{
#if LWIP_IPV4
    struct netif *net_interface  = NULL;
    uint32_t ipv4_addr;
    ip4_addr_t *addr = NULL;

    UNUSED_VARIABLE(addr);

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__);
    if ((net_mask_addr == NULL) || (is_interface_valid(iface_context) != CY_RSLT_SUCCESS))
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    net_interface = (struct netif *)(iface_context->nw_interface);

#if LWIP_IPV6
    ipv4_addr = net_interface->netmask.u_addr.ip4.addr;
    addr = &net_interface->netmask.u_addr.ip4;
#else
    ipv4_addr = net_interface->netmask.addr;
    addr = &net_interface->netmask;
#endif

    net_mask_addr->version = NW_IP_IPV4;
    net_mask_addr->ip.v4 = ipv4_addr;
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "net mask IP Address %s assigned \n", ip4addr_ntoa(addr));

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__);
    return CY_RSLT_SUCCESS;
#else
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() LWIP_IPV4 flag is not enabled \n", __FUNCTION__);
    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

cy_rslt_t cy_network_dhcp_renew(cy_network_interface_context *iface)
{
#if LWIP_IPV4
    uint8_t interface_index;

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__);
    if (is_interface_valid(iface) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    interface_index = (uint8_t)((iface->iface_type == CY_NETWORK_ETH_INTERFACE) ? (CY_NETWORK_ETH_INTERFACE + iface->iface_idx) : iface->iface_type);

    /* Invalidate ARP entries */
    netifapi_netif_common(LWIP_IP_HANDLE(interface_index), (netifapi_void_fn) invalidate_all_arp_entries, NULL);


    /*
     * If LPA is enabled, invoke the activity callback to resume the network stack
     * before invoking the lwIP APIs that require the TCP core lock.
     */
    if (activity_callback)
    {
        activity_callback(true);
    }

    /* Renew DHCP */
    netifapi_netif_common(LWIP_IP_HANDLE(interface_index), NULL, dhcp_renew);

    cy_rtos_delay_milliseconds(DCHP_RENEWAL_DELAY_IN_MS);

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__);
    return CY_RSLT_SUCCESS;
#else
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() LWIP_IPV4 flag is not enabled \n", __FUNCTION__);
    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

/**
 * Remove all ARP table entries of the specified netif.
 * @param netif Points to a network interface
 */
#if LWIP_IPV4
static void invalidate_all_arp_entries(struct netif *netif)
{
    /*Free all entries in ARP list */
    etharp_cleanup_netif(netif);
}
#endif

cy_rslt_t cy_network_ping(void *iface_context, cy_nw_ip_address_t *address, uint32_t timeout_ms, uint32_t* elapsed_time_ms)
{
#if LWIP_IPV4
    cy_time_t send_time;
    cy_time_t recvd_time;
    err_t err;
    struct timeval timeout_val;
    struct icmp_packet ping_packet;
    uint16_t ping_seq_num = 0;
    int socket_for_ping = -1;
    struct netif *net_interface;
    char if_name[PING_IF_NAME_LEN];
    struct ifreq iface;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__);

    if (iface_context == NULL || address == NULL || elapsed_time_ms == NULL)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid arguments \n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    cy_network_interface_context *if_ctx;
    if_ctx = (cy_network_interface_context *)iface_context;

    /*
     * If LPA is enabled, invoke the activity callback to resume the network stack,
     * before invoking the LwIP APIs
    */
    if (activity_callback)
    {
        activity_callback(true);
    }

    /* Open a local socket for pinging */
    socket_for_ping = lwip_socket(AF_INET, SOCK_RAW, IP_PROTO_ICMP);
    if (socket_for_ping < 0)
    {
        result = CY_RSLT_NETWORK_ERROR_PING;
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "lwiP socket open error \n");
        goto exit;
    }

    /* Convert the timeout into struct timeval */
    timeout_val.tv_sec  = (long)(timeout_ms / 1000);
    timeout_val.tv_usec = (long)((timeout_ms % 1000) * 1000);

