RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_network_mw_core.c
    /*
     * If LPA is enabled, invoke the activity callback to resume the network stack,
     * before invoking the LwIP APIs
    */
    if (activity_callback)
    {
        activity_callback(true);
    }

    /* Set the receive timeout on the local socket, so ping will time out */
    if (lwip_setsockopt(socket_for_ping, SOL_SOCKET, SO_RCVTIMEO, &timeout_val, sizeof(struct timeval)) != ERR_OK)
    {
        result = CY_RSLT_NETWORK_ERROR_PING;
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "lwip socket setting receive timeout error \n");
        goto exit;
    }

    /* Bind the interface to the device */
    net_interface = (struct netif *)if_ctx->nw_interface;
    memset(&iface, 0, sizeof(iface));
    memcpy(if_name, net_interface->name, sizeof(net_interface->name));
    snprintf(&if_name[2], (PING_IF_NAME_LEN - 2), "%u", (uint8_t)(net_interface->num));
    memcpy(iface.ifr_name, if_name, PING_IF_NAME_LEN);

    /*
     * If LPA is enabled, invoke the activity callback to resume the network stack,
     * before invoking the LwIP APIs
    */
    if (activity_callback)
    {
        activity_callback(true);
    }
    if (lwip_setsockopt(socket_for_ping, SOL_SOCKET, SO_BINDTODEVICE, &iface, sizeof(iface)) != ERR_OK)
    {
        result = CY_RSLT_NETWORK_ERROR_PING;
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "lwip socket setting socket bind error \n");
        goto exit;
    }

    /* Send a ping request */
    err = ping_send(socket_for_ping, address, &ping_packet, &ping_seq_num);
    if (err != ERR_OK)
    {
        result = CY_RSLT_NETWORK_ERROR_PING;
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "sending ping failed\n");
        goto exit;
    }
    /* Record the time the ping request was sent */
    cy_rtos_get_time(&send_time);

    /* Wait for the ping reply */
    err = ping_recv(socket_for_ping, address, &ping_seq_num);
    if (err != ERR_OK)
    {
        result = CY_RSLT_NETWORK_ERROR_PING;
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "receiving ping failed\n");
        goto exit;
    }

    /* Compute the elapsed time since a ping request was initiated */
    cy_rtos_get_time(&recvd_time);
    *elapsed_time_ms = (uint32_t)(recvd_time - send_time);

exit:
    /* Close the socket */
    if (socket_for_ping >= 0)
    {
        /*
         * If LPA is enabled, invoke the activity callback to resume the network stack,
         * before invoking the LwIP APIs
        */
        if (activity_callback)
        {
            activity_callback(true);
        }
        lwip_close(socket_for_ping);
    }
    return result;
#else
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s() LWIP_IPV4 flag is not enabled \n", __FUNCTION__);
    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

#ifdef CYBSP_WIFI_CAPABLE
/* Used to register callback for EAPOL packets */
cy_rslt_t cy_wifimwcore_eapol_register_receive_handler(cy_wifimwcore_eapol_packet_handler_t eapol_packet_handler)
{
    internal_eapol_packet_handler = eapol_packet_handler;
    return CY_RSLT_SUCCESS;
}
#endif

/*
 * Following code is copied from lwip\STABLE-2_1_2_RELEASE\src\core\inet_chksum.c without
 * changing the content of the lwip_standard_chksum function. On M55 core with GCC compiler and with
 * high optimization lwip_standard_chksum() returns incorrect chksum value for a network packet.
 * Setting lower optimization level for this functions fixes the issue. So LWIP_CHKSUM is defined to
 * cy_lwip_standard_chksum in lwipopts.h for M55 core with non-debug mode and GCC compiler.
 */
#if (CY_CPU_CORTEX_M55) && defined(__GNUC__) && !defined(__ARMCC_VERSION) && !defined(__llvm__) && defined(NDEBUG)
#if (LWIP_CHKSUM_ALGORITHM == 1) /* Version #1 */
/**
 * lwip checksum
 *
 * @param dataptr points to start of data to be summed at any boundary
 * @param len length of data to be summed
 * @return host order (!) lwip checksum (non-inverted Internet sum)
 *
 * @note accumulator size limits summable length to 64k
 * @note host endianess is irrelevant (p3 RFC1071)
 */

__attribute__((optimize("-O3")))
u16_t
cy_lwip_standard_chksum(const void *dataptr, int len)
{
    u32_t acc;
    u16_t src;
    const u8_t *octetptr;

    acc = 0;
    /* dataptr may be at odd or even addresses */
    octetptr = (const u8_t *)dataptr;
    while (len > 1)
    {
        /* declare first octet as most significant
           thus assume network order, ignoring host order */
        src = (*octetptr) << 8;
        octetptr++;
        /* declare second octet as least significant */
        src |= (*octetptr);
        octetptr++;
        acc += src;
        len -= 2;
    }
    if (len > 0)
    {
        /* accumulate remaining octet */
        src = (*octetptr) << 8;
        acc += src;
    }
    /* add deferred carry bits */
    acc = (acc >> 16) + (acc & 0x0000ffffUL);
    if ((acc & 0xffff0000UL) != 0)
    {
        acc = (acc >> 16) + (acc & 0x0000ffffUL);
    }
    /* This maybe a little confusing: reorder sum using lwip_htons()
       instead of lwip_ntohs() since it has a little less call overhead.
       The caller must invert bits for Internet sum ! */
    return lwip_htons((u16_t)acc);
}
#endif

#if (LWIP_CHKSUM_ALGORITHM == 2) /* Alternative version #2 */
/*
 * Curt McDowell
 * Broadcom Corp.
 * csm@broadcom.com
 *
 * IP checksum two bytes at a time with support for
 * unaligned buffer.
 * Works for len up to and including 0x20000.
 * by Curt McDowell, Broadcom Corp. 12/08/2005
 *
 * @param dataptr points to start of data to be summed at any boundary
 * @param len length of data to be summed
 * @return host order (!) lwip checksum (non-inverted Internet sum)
 */
__attribute__((optimize("-O3")))
u16_t
cy_lwip_standard_chksum(const void *dataptr, int len)
{
    const u8_t *pb = (const u8_t *)dataptr;
    const u16_t *ps;
    u16_t t = 0;
    u32_t sum = 0;
    int odd = ((mem_ptr_t)pb & 1);

    /* Get aligned to u16_t */
    if (odd && len > 0)
    {
        ((u8_t *)&t)[1] = *pb++;
        len--;
    }

    /* Add the bulk of the data */
    ps = (const u16_t *)(const void *)pb;
    while (len > 1)
    {
        sum += *ps++;
        len -= 2;
    }

    /* Consume left-over byte, if any */
    if (len > 0)
    {
        ((u8_t *)&t)[0] = *(const u8_t *)ps;
    }

