RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_network_mw_core.c
    /* Add end bytes */
    sum += t;

    /* Fold 32-bit sum to 16 bits
       calling this twice is probably faster than if statements... */
    sum = FOLD_U32T(sum);
    sum = FOLD_U32T(sum);

    /* Swap if alignment was odd */
    if (odd)
    {
        sum = SWAP_BYTES_IN_WORD(sum);
    }

    return (u16_t)sum;
}
#endif

#if (LWIP_CHKSUM_ALGORITHM == 3) /* Alternative version #3 */
/**
 * An optimized checksum routine. Basically, it uses loop-unrolling on
 * the checksum loop, treating the head and tail bytes specially, whereas
 * the inner loop acts on 8 bytes at a time.
 *
 * @arg start of buffer to be checksummed. May be an odd byte address.
 * @len number of bytes in the buffer to be checksummed.
 * @return host order (!) lwip checksum (non-inverted Internet sum)
 *
 * by Curt McDowell, Broadcom Corp. December 8th, 2005
 */
__attribute__((optimize("-O3")))
u16_t
cy_lwip_standard_chksum(const void *dataptr, int len)
{
    const u8_t *pb = (const u8_t *)dataptr;
    const u16_t *ps;
    u16_t t = 0;
    const u32_t *pl;
    u32_t sum = 0, tmp;
    /* starts at odd byte address? */
    int odd = ((mem_ptr_t)pb & 1);

    if (odd && len > 0)
    {
        ((u8_t *)&t)[1] = *pb++;
        len--;
    }

    ps = (const u16_t *)(const void *)pb;

    if (((mem_ptr_t)ps & 3) && len > 1)
    {
        sum += *ps++;
        len -= 2;
    }

    pl = (const u32_t *)(const void *)ps;

    while (len > 7)
    {
        tmp = sum + *pl++;          /* ping */
        if (tmp < sum)
        {
            tmp++;                    /* add back carry */
        }

        sum = tmp + *pl++;          /* pong */
        if (sum < tmp)
        {
            sum++;                    /* add back carry */
        }

        len -= 8;
    }

    /* make room in upper bits */
    sum = FOLD_U32T(sum);

    ps = (const u16_t *)pl;

    /* 16-bit aligned word remaining? */
    while (len > 1)
    {
        sum += *ps++;
        len -= 2;
    }

    /* dangling tail byte remaining? */
    if (len > 0)                  /* include odd byte */
    {
        ((u8_t *)&t)[0] = *(const u8_t *)ps;
    }

    sum += t;                     /* add end bytes */

    /* Fold 32-bit sum to 16 bits
       calling this twice is probably faster than if statements... */
    sum = FOLD_U32T(sum);
    sum = FOLD_U32T(sum);

    if (odd)
    {
        sum = SWAP_BYTES_IN_WORD(sum);
    }

    return (u16_t)sum;
}
#endif
#endif /*(CY_CPU_CORTEX_M55) && defined(__GNUC__) && !defined(__ARMCC_VERSION) && defined(NDEBUG)*/

#if LWIP_IPV4
static void ping_prepare_echo(struct icmp_packet *iecho, uint16_t len, uint16_t *ping_seq_num)
{
    int i;
    ICMPH_TYPE_SET(&iecho->hdr, ICMP_ECHO);
    ICMPH_CODE_SET(&iecho->hdr, 0);
    iecho->hdr.chksum = 0;
    iecho->hdr.id = PING_ID;
    iecho->hdr.seqno = htons(++(*ping_seq_num));

    /* Fill the additional data buffer with some data */
    for (i = 0; i < (int)sizeof(iecho->data); i++)
    {
        iecho->data[i] = (uint8_t)i;
    }

#ifndef COMPONENT_CAT3
    iecho->hdr.chksum = inet_chksum(iecho, len);
#endif
}

static err_t ping_send(int socket_hnd, const cy_nw_ip_address_t* address, struct icmp_packet *iecho, uint16_t *sequence_number)
{
    int                err;
    struct sockaddr_in to;

    /* Construct ping request */
    ping_prepare_echo(iecho, sizeof(struct icmp_packet), sequence_number);

    /* Send the ping request */
    to.sin_len         = sizeof(to);
    to.sin_family      = AF_INET;
    to.sin_addr.s_addr = address->ip.v4;

    /*
     * If LPA is enabled, invoke the activity callback to resume the network stack,
     * before invoking the LwIP APIs
    */
    if (activity_callback)
    {
        activity_callback(true);
    }
    err = lwip_sendto(socket_hnd, iecho, sizeof(struct icmp_packet), 0, (struct sockaddr*) &to, sizeof(to));

    return (err ? ERR_OK : ERR_VAL);
}

static err_t ping_recv(int socket_hnd, cy_nw_ip_address_t* address, uint16_t *ping_seq_num)
{
    char                  buf[PING_RESPONSE_LEN];
    int                   fromlen;
    int                   len;
    struct sockaddr_in    from;
    struct ip_hdr*        iphdr;
    struct icmp_echo_hdr* iecho;
    do
    {
        len = lwip_recvfrom(socket_hnd, buf, sizeof(buf), 0, (struct sockaddr*) &from, (socklen_t*) &fromlen);
        if (len >= (int)(sizeof(struct ip_hdr) + sizeof(struct icmp_echo_hdr)))
        {
            iphdr = (struct ip_hdr *) buf;
            iecho = (struct icmp_echo_hdr *)(buf + (IPH_HL(iphdr) * 4));

            if ((iecho->id == PING_ID) &&
                    (iecho->seqno == htons(*ping_seq_num)) &&
                    (ICMPH_TYPE(iecho) == ICMP_ER))
            {
                return ERR_OK; /* Echo reply received - return success */
            }
        }
    }
    while (len > 0);

    return ERR_TIMEOUT; /* No valid echo reply received before timeout */
}
#endif

static void internal_ip_change_callback(struct netif *netif)
{
    cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IP change callback triggered\n");
    /* Notify ECM about IP address change */
    if (ip_change_callback != NULL)
    {
        for (int i = 0; i < CY_IFACE_MAX_HANDLE; i++)
        {
            if (netif == (struct netif *)iface_context_database[i].nw_interface)
            {
                cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "netif:[%p] iface_context_database[i].nw_interface:[%p]\n", netif, iface_context_database[i].nw_interface);
                ip_change_callback(&(iface_context_database[i]), NULL);
                return;
            }
        }
    }
}

static bool is_interface_added(uint8_t interface_index)
{
    return (ip_networking_inited[interface_index & 3]);
}

static bool is_network_up(uint8_t interface_index)
{
    return (ip_up[interface_index & 3]);
}

static cy_rslt_t is_interface_valid(cy_network_interface_context *iface)
{
    if ((iface == NULL) ||
            (iface->nw_interface == NULL) ||
            (iface->hw_interface == NULL) ||
            (((iface->iface_type != CY_NETWORK_WIFI_STA_INTERFACE) && (iface->iface_type != CY_NETWORK_WIFI_AP_INTERFACE)) &&
             (iface->iface_type != CY_NETWORK_ETH_INTERFACE) && (iface->iface_idx >= MAX_ETHERNET_PORT))
       )
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "iface->iface_type:[%d] iface->iface_idx:[%d]\n", iface->iface_type, iface->iface_idx);
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    return CY_RSLT_SUCCESS;
}

#ifdef COMPONENT_4390X
/* CYW43907 kits do not have a TRNG module.
 * The following are the functions to generate pseudorandon numbers.
 * These functions are internal to the AnyCloud library; currently used
 * by Secure Sockets and WCM.
 */
static uint32_t crc32_calc(const uint8_t* buffer, uint16_t buffer_length, uint32_t prev_crc32)
{
    uint32_t crc32 = ~prev_crc32;
    int i;

    for (i = 0; i < buffer_length; i++)
    {
        int j;

