RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_network_mw_core.c
        crc32 ^= buffer[ i ];

        for (j = 0; j < 8; j++)
        {
            if (crc32 & 0x1)
            {
                crc32 = (crc32 >> 1) ^ CY_PRNG_CRC32_POLYNOMIAL;
            }
            else
            {
                crc32 = (crc32 >> 1);
            }
        }
    }

    return ~crc32;
}

static uint32_t prng_well512_get_random(void)
{
    /*
     * Implementation of WELL (Well Equidistributed Long-period Linear) pseudorandom number generator.
     * Use the WELL512 source code placed by the inventor to public domain.
     */

    uint32_t a, b, c, d;
    uint32_t result;

    cy_rtos_get_mutex(cy_prng_mutex_ptr, CY_RTOS_NEVER_TIMEOUT);

    a = prng_well512_state[ prng_well512_index ];
    c = prng_well512_state[(prng_well512_index + 13) & 15 ];
    b = a ^ c ^ (a << 16) ^ (c << 15);
    c = prng_well512_state[(prng_well512_index + 9) & 15 ];
    c ^= (c >> 11);
    a = prng_well512_state[ prng_well512_index ] = b ^ c;
    d = a ^ ((a << 5) & (uint32_t)0xDA442D24UL);
    prng_well512_index = (prng_well512_index + 15) & 15;
    a = prng_well512_state[ prng_well512_index ];
    prng_well512_state[ prng_well512_index ] = a ^ b ^ d ^ (a << 2) ^ (b << 18) ^ (c << 28);

    result = prng_well512_state[ prng_well512_index ];

    cy_rtos_set_mutex(cy_prng_mutex_ptr);

    return result;
}

static void prng_well512_add_entropy(const void* buffer, uint16_t buffer_length)
{
    uint32_t crc32[ CY_PRNG_WELL512_STATE_SIZE ];
    uint32_t curr_crc32 = 0;
    unsigned i;

    for (i = 0; i < CY_PRNG_WELL512_STATE_SIZE; i++)
    {
        curr_crc32 = crc32_calc(buffer, buffer_length, curr_crc32);
        crc32[ i ] = curr_crc32;
    }

    cy_rtos_get_mutex(cy_prng_mutex_ptr, CY_RTOS_NEVER_TIMEOUT);

    for (i = 0; i < CY_PRNG_WELL512_STATE_SIZE; i++)
    {
        prng_well512_state[ i ] ^= crc32[ i ];
    }

    cy_rtos_set_mutex(cy_prng_mutex_ptr);
}

static bool prng_is_add_cyclecnt_entropy(uint32_t buffer_length)
{
    bool add_entropy = false;

    cy_rtos_get_mutex(cy_prng_mutex_ptr, CY_RTOS_NEVER_TIMEOUT);

    if (prng_add_cyclecnt_entropy_bytes >= CY_PRNG_ADD_CYCLECNT_ENTROPY_EACH_N_BYTE)
    {
        prng_add_cyclecnt_entropy_bytes %= CY_PRNG_ADD_CYCLECNT_ENTROPY_EACH_N_BYTE;
        add_entropy = true;
    }

    prng_add_cyclecnt_entropy_bytes += buffer_length;

    cy_rtos_set_mutex(cy_prng_mutex_ptr);

    return add_entropy;
}

static void prng_add_cyclecnt_entropy(uint32_t buffer_length)
{
    cy_rslt_t result;
    if (prng_is_add_cyclecnt_entropy(buffer_length))
    {
        cy_time_t cycle_count;
        result = cy_rtos_get_time(&cycle_count);
        if (result == CY_RSLT_SUCCESS)
        {
            prng_well512_add_entropy(&cycle_count, sizeof(cycle_count));
        }
    }
    return;
}

cy_rslt_t cy_prng_get_random(void* buffer, uint32_t buffer_length)
{
    uint8_t *p = buffer;

    prng_add_cyclecnt_entropy(buffer_length);

    while (buffer_length != 0)
    {
        uint32_t rnd_val = prng_well512_get_random();
        int      i;

        for (i = 0; i < 4; i++)
        {
            *p++ = (uint8_t)(rnd_val & 0xFF);
            if (--buffer_length == 0)
            {
                break;
            }
            rnd_val = (rnd_val >> 8);
        }
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_prng_add_entropy(const void* buffer, uint32_t buffer_length)
{
    prng_well512_add_entropy(buffer, buffer_length);
    return CY_RSLT_SUCCESS;
}
#endif

#if defined(COMPONENT_CAT1)
static int cy_trng_release()
{
    if (Cy_Crypto_Core_IsEnabled(CRYPTO))
    {
        Cy_Crypto_Core_Disable(CRYPTO);
    }
    return 0;
}
static int cy_trng_reserve()
{
    cy_en_crypto_status_t crypto_status;

    crypto_status = Cy_Crypto_Core_Enable(CRYPTO);
    if (crypto_status != CY_CRYPTO_SUCCESS)
    {
        cy_rtos_set_mutex(&trng_mutex);
        cy_rtos_deinit_mutex(&trng_mutex);
        return CY_RSLT_NETWORK_ERROR_TRNG;
    }
    return 0;
}

cy_rslt_t cy_network_random_number_generate(unsigned char *output, size_t len, size_t *olen)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    *olen = 0;
    /* temporary random data buffer */
    uint32_t random = 0u;

    result = cy_rtos_get_mutex(&trng_mutex, CY_RTOS_NEVER_TIMEOUT);
    if (CY_RSLT_SUCCESS != result)
    {
        cy_rtos_deinit_mutex(&trng_mutex);
        return CY_RSLT_NETWORK_ERROR_TRNG;
    }

    if (cy_trng_reserve() != 0)
    {
        return CY_RSLT_NETWORK_ERROR_TRNG;
    }

    /* Get Random byte */
    while (*olen < len)
    {
        if (Cy_Crypto_Core_Trng(CRYPTO, CY_CRYPTO_DEF_TR_GARO, CY_CRYPTO_DEF_TR_FIRO,
                                MAX_TRNG_BIT_SIZE, &random) != CY_CRYPTO_SUCCESS)
        {
            return CY_RSLT_NETWORK_ERROR_TRNG;
        }
        else
        {
            for (uint8_t i = 0; (i < 4) && (*olen < len) ; i++)
            {
                *output++ = ((uint8_t *)&random)[i];
                *olen += 1;
            }
        }
    }
    random = 0uL;

    Cy_Crypto_Core_Trng_DeInit(CRYPTO);
    if (cy_trng_release() != 0)
    {
        return CY_RSLT_NETWORK_ERROR_TRNG;
    }
    cy_rtos_set_mutex(&trng_mutex);
    return result;
}
#endif
